Repository: tinkoff-mobile-tech/tinkoff-asdk-ios
Catalog: TinkoffASDKUI/TinkoffASDKUI/Resources/Strings/*.lproj/Localizable.strings
Languages: ru

# TinkoffAcquiring.unknown.response.status
source: Unknown Status
ru: Неизвестный статус платежа

# TinkoffAcquiring.unknown.error.status
source: Unknown Error. Please try again later.
ru: Неизвесная ошибка. Попробуйте поворить операцию.

# TinkoffAcquiring.alert.title.error
source: Error
ru: Ошибка

# TinkoffAcquiring.alert.title.cardSuccessAdded
source: Success
ru: Карта добавлена

# TinkoffAcquiring.alert.title.addingCard
source: Adding card
ru: Добавление карты

# TinkoffAcquiring.alert.message.addingCardCancel
source: The operation was cancelled
ru: Операция отменена

# TinkoffAcquiring.button.update
source: Update
ru: Обновить

# TinkoffAcquiring.button.cancel
source: Cancel
ru: Отмена

# TinkoffAcquiring.button.close
source: Close
ru: Закрыть

# TinkoffAcquiring.button.payByCard
source: Pay by card
ru: Оплатить по карте

# TinkoffAcquiring.button.payBy
source: Pay by
ru: Оплатить через

# TinkoffAcquiring.button.qrcode
source: QR-code
ru: QR-код

# TinkoffAcquiring.button.addCard
source: Add Card
ru: Добавить

# TinkoffAcquiring.button.confirm
source: Confirm
ru: Подтвердить

# TinkoffAcquiring.button.delete
source: Delete
ru: Удалить

# TinkoffAcquiring.text.status.waitingInitPayment
source: Waiting payment initializer
ru: Инициалихация платежа

# TinkoffAcquiring.text.status.waitingPayment
source: Waiting for payment receipt
ru: Ожидание оплаты

# TinkoffAcquiring.text.status.cardListEmpty
source: Card List Empty
ru: Сохраненных карт нет

# TinkoffAcquiring.text.status.loading
source: Loading
ru: Загрузка ...

# TinkoffAcquiring.text.status.selectingPaymentSource
source: Selecting a payment source
ru: Выбор источника оплаты

# TinkoffAcquiring.text.status.error.email
source: Incorrect email
ru: Неверный формат электронной почты

# TinkoffAcquiring.text.status.error.emailEmpty
source: Please enter email
ru: Введите email

# TinkoffAcquiring.text.addcard
source: Add card
ru: Добавить карту

# TinkoffAcquiring.text.addNewCard
source: Add new card
ru: Добавить новую карту

# TinkoffAcquiring.text.loopConfirmation
source: To confirm the operation, we debited and refunded a small amount (up to 1,99 rubles) Please specify it.
ru: Для подтверждения операции мы списали и вернули небольшую сумму (до 1,99 руб.) Пожалуйста, укажите ее с точностью до копеек.

# TinkoffAcquiring.text.or
source: or
ru: или

# TinkoffAcquiring.hint.loopAmount
source: all amount, down to the penny
ru: сумма с точностью до копеек

# TinkoffAcquiring.error.loopAmount
source: please, enter the amount
ru: укажите сумму с точностью до копеек

# TinkoffAcquiring.placeholder.cardNumber
source: Card number
ru: Номер карты

# TinkoffAcquiring.placeholder.sendReceiptToEmail
source: Send receipt to email
ru: Отправить квитанцию по адресу

# TinkoffAcquiring.placeholder.loopAmount
source: for example 0,89
ru: Например 0,89

# TinkoffAcquiring.view.title.pay
source: Payment
ru: Оплата

# TinkoffAcquiring.view.title.savedCards
source: Saved cards
ru: Сохраненные карты

# TinkoffAcquiring.view.title.payQRCode
source: Payment by QR-code
ru: Оплата по QR-коду

# TinkoffAcquiring.view.title.confimration
source: Confirmation
ru: Подтверждение

# Acquiring.SBP.ScreenTitle
source: Choose bank
ru: Выбор банка

# Acquiring.SBPBanks.ButtonClose
source: Close
ru: Закрыть

# Acquiring.SBPBanks.AnotherBank
source: Another bank
ru: Другой банк

# Acquiring.SBPAllBanks.SearchPlaceholder
source: Name
ru: Название

# CommonAlert.SBPNoBank.Title
source: Unable to find this bank’s app
ru: Не получилось найти приложение этого банка

# CommonAlert.SBPNoBank.Description
source: Install it or choose another bank
ru: Установите его или выберите другой банк

# CommonAlert.Button
source: OK
ru: Понятно

# TP.LoadingStatus.Title
source: Payment confirmation awaiting
ru: Ожидаем подтверждения платежа

# TinkoffAcquiring.threeds.cancelAuth
source: Cancel
ru: Отменить

# TinkoffAcquiring.threeds.acceptAuth
source: Confirmation
ru: Подтверждение

# TinkoffAcquiring.threeds.error.invalidPaymentSystem
source: Payment system is not supported
ru: Платежная система не поддерживается

# TinkoffAcquiring.threeds.error.updatingCertsError
source: Unable to update certificates
ru: Не удалось обновить сертификаты

# TinkoffAcquiring.threeds.error.timeout
source: 3DS operation timed out
ru: Превышено маскимальное время прохождения 3DS

# Acquiring.CardList.ScreenTitle
source: Your Cards
ru: Ваши карты

# Acquiring.CardList.ButtonChange
source: Edit
ru: Изменить

# Acquiring.CardList.ButtonDone
source: Done
ru: Готово

# CardList.alert.title.deleteCard
source: Delete this card
ru: Удаление карты

# CardList.alert.message.deleteCard
source: Are you sure you want to delete the card %@?
ru: Вы уверены, что хотите удалить карту %@?

# CardList.alert.action.cancel
source: Cancel
ru: Отмена

# CardList.alert.action.delete
source: Delete
ru: Удалить

# CardList.status.noCards
source: You don't have any saved cards
ru: У вас нет сохраненных карт

# CardList.button.addNewCard
source: Add new card
ru: Добавить новую карту

# CardList.screen.title.paymentByCard
source: Payment by card
ru: Оплата картой

# CardList.button.anotherCard
source: Another card
ru: Другой картой

# AcquiringPayment.button.chooseCard
source: Choose another card
ru: Выбрать другую карту

# Acquiring.CardField.PanTitle
source: Number
ru: Номер

# Acquiring.CardField.TermTitle
source: Valid through
ru: Срок

# Acquiring.CardField.CVVTitle
source: CVC
ru: Код

# Acquiring.Common.SberCardTitle
source: SberBank
ru: СберБанк

# Acquiring.Common.TcsCardTitle
source: Tinkoff Bank
ru: Тинькофф

# Acquiring.Common.VtbCardTitle
source: Bank VTB
ru: Банк ВТБ

# Acquiring.Common.AlfaCardTitle
source: Alfa Bank
ru: Альфа Банк

# Acquiring.Common.GazpromCardTitle
source: Gazprom Bank
ru: Газпром Банк

# Acquiring.Common.RaiffeisenCardTitle
source: Raiffeisen Bank
ru: Райффайзен Банк

# CommonAlert.DeleteCard.Title
source: Unable to remove the card
ru: Не получилось удалить карту

# CommonAlert.AddCard.Title
source: Card is already added
ru: Карта уже добавлена

# CommonAlert.SomeProblem.Title
source: We have a problem, working on it already
ru: У нас проблема, мы уже решаем ее

# CommonAlert.SomeProblem.Description
source: Try again in a couple of minutes
ru: Попробуйте снова через пару минут

# Acquiring.CardList.AddCard
source: Add new
ru: Добавить новую

# Acquiring.CardList.DeleteSnackBar
source: Deleting card
ru: Удаляем карту

# Acquiring.CardList.AddSnackBar
source: Card %@ added
ru: Карта %@ добавлена

# Acquiring.AddNewCard.ScreenTitle
source: New Card
ru: Новая карта

# Acquiring.AddNewCard.ButtonClose
source: Close
ru: Закрыть

# Acquiring.AddNewCard.AddButton
source: Add
ru: Добавить

# Acquiring.PaymentNewCard.ScreenTitle
source: Pay by card
ru: Оплата картой

# Acquiring.PaymentNewCard.ButtonClose
source: Close
ru: Закрыть

# Acquiring.PaymentNewCard.PaymentButton
source: Pay
ru: Оплатить

# Acquiring.EmailField.Title
source: Email
ru: Электронная почта

# Acquiring.EmailField.SwitchButton
source: Get receipt
ru: Получить квитанцию

# CommonStub.SomeProblem.Title
source: We have a problem, working on it already
ru: У нас проблема, мы уже решаем ее

# CommonStub.NoNetwork.Title
source: Loading failed
ru: Не загрузилось

# CommonStub.SomeProblem.Description
source: Try again in a couple of minutes
ru: Попробуйте снова через пару минут

# CommonStub.NoNetwork.Description
source: Check internet connection and try again
ru: Проверьте доступ к интернету и попробуйте еще раз

# CommonStub.NoCards.Description
source: Your cards will be shown here
ru: Здесь будут ваши карты

# CommonStub.NoCardsToPay.Description
source: No cards to pay
ru: Нет карт для оплаты

# CommonStub.SomeProblem.Button
source: Got it
ru: Понятно

# CommonStub.NoNetwork.Button
source: Reload
ru: Обновить

# CommonStub.NoCards.Button
source: Add
ru: Добавить

# CommonStub.NoCardsToPay.Button
source: Pay with a new
ru: Оплатить новой

# CommonSheet.Processing.Title
source: Processing payment
ru: Обрабатываем платеж

# CommonSheet.Processing.Description
source: This will take some time
ru: Это займет некоторое время

# CommonSheet.Paid.Title
source: Payment complete
ru: Оплачено

# CommonSheet.Paid.PrimaryButton
source: Got it
ru: Понятно

# CommonSheet.PaymentWaiting.Title
source: Waiting for payment in the bank’s app
ru: Ждем оплату в приложении банка

# CommonSheet.PaymentWaiting.SecondaryButton
source: Close
ru: Закрыть

# CommonSheet.TimeoutFailed.Title
source: Payment time ran out
ru: Время оплаты истекло

# CommonSheet.TimeoutFailed.Description
source: Try paying again
ru: Попробуйте оплатить снова

# CommonSheet.TimeoutFailed.SecondaryButton
source: Close
ru: Закрыть

# CommonSheet.PaymentFailed.Title
source: Payment failed
ru: Ошибка при оплате

# CommonSheet.PaymentFailed.Description
source: Try another method
ru: Попробуйте другой способ оплаты

# CommonSheet.PaymentFailed.PrimaryButton
source: Choose another method
ru: Выбрать другой способ

# YandexSheet.Failed.Title
source: Payment error
ru: Не получилось оплатить

# YandexSheet.Failed.Description
source: Use a different payment method
ru: Воспользуйтесь другим способом оплаты

# YandexSheet.Failed.PrimaryButton
source: Ok
ru: Понятно
