Repository: tinkoff-mobile-tech/tinkoff-asdk-ios
Catalog: ASDKSample/ASDKSample/Resources/Strings/*.lproj/Localizable.strings
Languages: ru

# title.onlineShop
source: Online shop
ru: Онлайн магазин

# title.pay
source: Pay
ru: Оплата

# title.paymeny
source: Payment
ru: Оплатить

# title.settings
source: Settings
ru: Настройки

# title.cart
source: Cart
ru: Корзина

# title.paymentCardList
source: Saved cards
ru: Список карт

# title.qrcode
source: QR-code
ru: QR-код

# title.savingCard
source: Saving card
ru: Сохранение карты

# title.paymentFormLanguage
source: Payment Form Language
ru: Локализация платежной формы

# title.fasterPayments
source: Faster Payments Service
ru: Система Быстрых Платежей

# title.showEmailField
source: Email field
ru: Поле ввода email

# title.paymentSource
source: Payment Source
ru: Источник оплаты

# title.aquaringAlertView
source: AlertView type
ru: AlertView

# title.goods
source: Goods
ru: Товары

# title.paymentTryAgain
source: Try quick payment
ru: Повторить платеж

# title.payByApplePay
source: Pay By ApplePay
ru: Оплатить с помощью ApplePay

# title.payBySBP
source: Pay By SBP
ru: Оплатить с помощью Системы Быстрых Платежей

# title.payAndSaveAsParent
source: Pay and save as parent payment
ru: Оплатить, начать регулярный платеж

# title.Acquiring
source: Alert View Type
ru: Уведомления, алерты

# text.showEmailField
source: Show email field for required enter on a payment screen. After payment success, payment receipt sended to this email.
ru: Показать на платежной форме поле для ввода email куда будет отправлен чек полсе оплаты

# text.Acquiring.description
source: Use AlertView system or from Acquiring SDK
ru: Использовать AlertView системный или из Acquiring SDK

# text.parentPayment
source: Parent payment
ru: Родительский платеж

# text.totalAmount
source: total amount
ru: на сумму

# text.payBySBP.description
source: Show generate QR-code on main screen, add sbp button on a payment screen
ru: на главном экране кнопка сгенерировать QR-код для приема платежей, на форме платежей добавляеся кнопка оплатить с помощью СБП

# text.addCardCheckType.description
source: NO - save card without checking. In this case parent payment not generated. 3DS - save card with 3ds chenking with payment for 1 ruble and refund 1 ruble. Cards without supported 3DS not saved. In success, if card is saved, this paymen save as the parent. HOLD - try payment for 1 ruble and refund 1 ruble.In success, if card is saved, this paymen save as the parent. 3DSHOLD - save card with 3ds chenking with payment for 1 ruble and refund 1 ruble. Cards without supported 3DS not saved. In success, if card is saved, this paymen save as the parent.
ru: NO – сохранить карту без проверок. Родительский платеж в случае успеха не создастся. 3DS – при сохранении карты выполнить проверку 3DS и выполнить списание, а затем отмену на 1 р. Карты, не поддерживающие 3DS, привязаны не будут. В случае успеха сгенерируется родительский платеж, для рекуррентных платежей. HOLD – при сохранении сделать списание и затем отмену на 1 руб. В случае успеха сгенерируется родительский платеж для рекуррентных платежей. 3DSHOLD – при привязке карты выполняем проверку, поддерживает карта 3DS или нет. Если карта поддерживает 3DS выполняем списание и затем отмену на 1 руб.

# text.language.description
source: auto - Set system language region for payment form. ru - Set Russian language for payment form. en - Set English language for payment form
ru: auto - Устанавливается язык который выбран на устройстве. ru - Платежная форма на Русском языке. en - Платежная форма на Англисйком языке.

# text.paymentStatusAmount
source: The purchase in the amount
ru: Покупка на сумму

# text.paymentStatusCancel
source: is cancelled
ru: отменена

# text.paymentStatusSuccess
source: is succeed
ru: прошла успешно.

# plaseholder.email
source: Send receipt to email
ru: Отправить квитанцию по адресу

# button.pay
source: Pay
ru: Оплатить

# button.cancel
source: Cancel
ru: Отменить

# button.done
source: Done
ru: Готово

# button.backToShop
source: Back
ru: Вернуться в магазин

# button.close
source: Close
ru: Закрыть

# button.generateQRCode
source: Generate QR-code
ru: Сгенерировать QR-код

# button.paymentTryAgain
source: Try Again
ru: Повторить платеж

# button.selectAnotherCard
source: Select Another Card
ru: Выбрать другую карту

# button.payAndSaveAsParent
source: Pay and save as Parent Payment
ru: Оплатить, начать регулярный платеж

# status.cartIsEmpty
source: Cart is empty
ru: Корзина пуста

# status.sbp.on
source: Activated
ru: Включены

# status.sbp.off
source: Deactivated
ru: Выключены

# status.showEmailField.on
source: Showing
ru: Показывать

# status.showEmailField.off
source: Hidden
ru: Скрыто

# status.alert.off
source: System
ru: Системные

# alert.title.cardSuccessAdded
source: Success
ru: Карта добавлена

# alert.message.addingCardCancel
source: The operation was cancelled
ru: Операция отменена

# error.device.setup
source: Device setup error occured
ru: Произошла ошибка настройки устройства

# error.camera.setup
source: Camera error
ru: Ошибка камеры

# error.camera.noSessionFound
source: No valid capture session found, I can't take any pictures or videos.
ru: Не найдена камера.

# error.camera.preset
source: Preset not supported
ru: Пресет не поддерживается

# error.camera.preset.message
source: Camera preset not supported. Please try another one.
ru: Пресет камеры не поддерживается. Пожалуйста, попробуйте другой.
