//
//  IAppChecker.swift
//  TinkoffASDKUI
//
//  Created by r.akhmadeev on 03.03.2023.
//

import Foundation

/// Проверяет наличие установленного приложения на устройстве
protocol IAppChecker {
    /// На основе переданной схемы определяет установлено ли приложение на данном устройстве
    ///
    /// С помощью данных из info.plist, определяет есть ли возможность проверить указанную схему.
    /// При отсутствии схемы в info.plist, Вернет ответ `AppCheckingResult.ambiguous`
    ///
    /// Примечание: В тестовой сборке сыплется куча системных логов о том что не может открыть ту или иную ссылку, в релизной сборке логов не будет
    /// - Parameter scheme: Схема, которую необходимо проверить для определения наличия приложения на устройстве
    /// - Returns: Результат проверки наличия установленного приложения с указанной схемой
    func checkApplication(withScheme scheme: String) -> AppCheckingResult
}
